app/Http/Livewire/CreateProductTarget.php

    public function mount() {

        set_time_limit(2000);
        ini_set('memory_limit', '2048M');

        $this->query = User::where('id', Auth::id())->first();
---
select * from `users` where `id` = 1 limit 1

//
//        $months = $fromDate->diffInMonths($toDate, false);
//        dd($months);
        $settings_record = Setting::first();
---
select * from `settings` limit 1

    public function generateReport()
    {
        set_time_limit(2000);
        ini_set('memory_limit', '2048M');

        $this->emps = [];
        $this->employee_branch_names = [];
//        $this->resetExcept(['branches', 'dept_id', 'filter_type', 'vendor_id']);
//        dd($this->vendor_id);
        $this->reset('target', 'results', 'current_year_list', 'current_target', 'current_target_to_edit', 'old_targets');
        $this->validate();
//        $this->results = [];
//        $current_year_list = [];
        $this->save_filters();

        $this->employee_ids_in_my_branch = [];
        foreach ($this->dept_id as $branch) {
            $emps = User::join('user_groups', 'user_groups.id', 'users.group')
                ->where('branches', 'like', '%"'.$branch.'"%')
                ->whereIn('write_product_target', ['1', '2'])
                ->select('users.id')
                ->get();
---
select `users`.`id` from `users` inner join `user_groups` on `user_groups`.`id` = `users`.`group` where `branches` like '%\"3\"%' and `write_product_target` in ('1', '2')

        $this->btn_save = true;

        if ($this->query->user_group->write_product_target == '2' || $this->query->user_group->write_product_target == '3' || $this->query->user_group->write_product_target == '0') {
            $this->emps = User::join('user_groups', 'users.group', 'user_groups.id')
---
select * from `user_groups` where `user_groups`.`id` = 5 limit 1

//            ->whereIn('users.id', $this->employee_ids_in_my_branch)
//            ->select('emp_percentage', 'branch', 'emp_code', 'product_target_emp_percents.user_id')
//            ->get();
        $this->emps_percentage = ProductTargetEmpPercent::join('users', 'product_target_emp_percents.user_id', 'users.id')
            ->whereIn('users.id', $this->employee_ids_in_my_branch)
            ->select('emp_percentage', 'branch', 'emp_code', 'product_target_emp_percents.user_id')
            ->get();
//        dd($this->employee_ids_in_my_branch);
//        dd($this->emps_percentage);

        $this->special_product_id = SpecialProduct::all();
---
select `emp_percentage`, `branch`, `emp_code`, `product_target_emp_percents`.`user_id` from `product_target_emp_percents` inner join `users` on `product_target_emp_percents`.`user_id` = `users`.`id` where `users`.`id` in (48, 50, 51, 49)
select * from `special_products`