app/Http/Livewire/ListWeeklyReport.php

    public function proccess_report() {

//        $this->categorize(['0100000'], '2023-10-01', '2023-10-02');
//        $this->categorize(['0300264'], '2023-09-30', '2023-10-05');
//        $this->categorize(['0300264'], '2023-09-30', '2023-10-05');
//        $this->cash2(['0300264'], '2023-09-30', '2023-10-05');
//        dd($this->postponed_sales2(['0600008'], '2023-10-21', '2023-10-27'));
//        $this->categorize(['0100550'], '2023-09-30', '2023-10-06');
//        $this->categorize(['0100660'], '2023-09-30', '2023-10-06');
//        $this->postponed_sales2(['0100584'], '2023-09-30', '2023-10-06');
//        $this->postponed_sales2(['0100660'], '2023-09-30', '2023-10-06');

//        $this->postponed_sales2('0100986', '27');
//        $this->categorize_speciality(['0600522'], '2023-10-1', '2023-10-7');

        set_time_limit(2000);
        $customers_code = AccMast::join('WarrentyInfo', 'accmast.NodeNo','WarrentyInfo.AccountNo')
            ->join('StudentMast', 'StudentMast.NodeNo', 'WarrentyInfo.SalesEmployee')
            ->where('WarrentyInfo.AccountStatus', 'عملاء نشيطين لدى الفرع')
            ->where(function ($query) {
                $query->orWhere('accmast.Code', 'like',  '01%')
                    ->orWhere('accmast.Code', 'like',  '02%')
                    ->orWhere('accmast.Code', 'like',  '03%')
                    ->orWhere('accmast.Code', 'like',  '04%')
                    ->orWhere('accmast.Code', 'like',  '05%')
                    ->orWhere('accmast.Code', 'like',  '06%')
                    ->orWhere('accmast.Code', 'like',  '07%')
                    ->orWhere('accmast.Code', 'like',  '08%')
                    ->orWhere('accmast.Code', 'like',  '09%')
                    ->orWhere('accmast.Code', 'like',  '10%')
                    ->orWhere('accmast.Code', 'like',  '11%')
                    ->orWhere('accmast.Code', 'like',  '12%')
                    ->orWhere('accmast.Code', 'like',  '1-01%')
                    ->orWhere('accmast.Code', 'like',  '1-02%')
                    ->orWhere('accmast.Code', 'like',  '1-03%')
                    ->orWhere('accmast.Code', 'like',  '1-04%')
                    ->orWhere('accmast.Code', 'like',  '1-05%')
                    ->orWhere('accmast.Code', 'like',  '1-06%')
                    ->orWhere('accmast.Code', 'like',  '1-07%')
                    ->orWhere('accmast.Code', 'like',  '1-08%')
                    ->orWhere('accmast.Code', 'like',  '1-09%')
                    ->orWhere('accmast.Code', 'like',  '1-10%')
                    ->orWhere('accmast.Code', 'like',  '1-11%')
                    ->orWhere('accmast.Code', 'like',  '1-12%');
            })
            ->whereRaw('LEN(accmast.Code) > 3')
            ->where('accmast.Code', 'like',  $this->area_id.'%')
            ->pluck('accmast.Code as customer_code');
---
select [accmast].[Code] as [customer_code] from [accmast] inner join [WarrentyInfo] on [accmast].[NodeNo] = [WarrentyInfo].[AccountNo] inner join [StudentMast] on [StudentMast].[NodeNo] = [WarrentyInfo].[SalesEmployee] where [WarrentyInfo].[AccountStatus] = 'عملاء نشيطين لدى الفرع' and ([accmast].[Code] like '01%' or [accmast].[Code] like '02%' or [accmast].[Code] like '03%' or [accmast].[Code] like '04%' or [accmast].[Code] like '05%' or [accmast].[Code] like '06%' or [accmast].[Code] like '07%' or [accmast].[Code] like '08%' or [accmast].[Code] like '09%' or [accmast].[Code] like '10%' or [accmast].[Code] like '11%' or [accmast].[Code] like '12%' or [accmast].[Code] like '1-01%' or [accmast].[Code] like '1-02%' or [accmast].[Code] like '1-03%' or [accmast].[Code] like '1-04%' or [accmast].[Code] like '1-05%' or [accmast].[Code] like '1-06%' or [accmast].[Code] like '1-07%' or [accmast].[Code] like '1-08%' or [accmast].[Code] like '1-09%' or [accmast].[Code] like '1-10%' or [accmast].[Code] like '1-11%' or [accmast].[Code] like '1-12%') and LEN(accmast.Code) > 3 and [accmast].[Code] like '02%'

    public function customer_details() {

        set_time_limit(2000);
        $records = AccMast::join('WarrentyInfo', 'accmast.NodeNo','WarrentyInfo.AccountNo')
            ->join('StudentMast', 'StudentMast.NodeNo', 'WarrentyInfo.SalesEmployee')
            ->where('WarrentyInfo.AccountStatus', 'عملاء نشيطين لدى الفرع')
//            ->where('accmast.Blocked', 'N')
//            ->where(function ($query) {
//                $query->orWhere('accmast.Accmast_Department', '3')
//                    ->orWhere('accmast.Accmast_Department', '10')
//                    ->orWhere('accmast.Accmast_Department', '7')
//                    ->orWhere('accmast.Accmast_Department', '13')
//                    ->orWhere('accmast.Accmast_Department', '4')
//                    ->orWhere('accmast.Accmast_Department', '6')
//                    ->orWhere('accmast.Accmast_Department', '5')
//                    ->orWhere('accmast.Accmast_Department', '12')
//                    ->orWhere('accmast.Accmast_Department', '11')
//                    ->orWhere('accmast.Accmast_Department', '9')
//                    ->orWhere('accmast.Accmast_Department', '8')
//                    ->orWhere('accmast.Accmast_Department', '505');
//            })
            ->where(function ($query) {
                $query->orWhere('accmast.Code', 'like',  '01%')
                    ->orWhere('accmast.Code', 'like',  '02%')
                    ->orWhere('accmast.Code', 'like',  '03%')
                    ->orWhere('accmast.Code', 'like',  '04%')
                    ->orWhere('accmast.Code', 'like',  '05%')
                    ->orWhere('accmast.Code', 'like',  '06%')
                    ->orWhere('accmast.Code', 'like',  '07%')
                    ->orWhere('accmast.Code', 'like',  '08%')
                    ->orWhere('accmast.Code', 'like',  '09%')
                    ->orWhere('accmast.Code', 'like',  '10%')
                    ->orWhere('accmast.Code', 'like',  '11%')
                    ->orWhere('accmast.Code', 'like',  '12%')
                    ->orWhere('accmast.Code', 'like',  '1-01%')
                    ->orWhere('accmast.Code', 'like',  '1-02%')
                    ->orWhere('accmast.Code', 'like',  '1-03%')
                    ->orWhere('accmast.Code', 'like',  '1-04%')
                    ->orWhere('accmast.Code', 'like',  '1-05%')
                    ->orWhere('accmast.Code', 'like',  '1-06%')
                    ->orWhere('accmast.Code', 'like',  '1-07%')
                    ->orWhere('accmast.Code', 'like',  '1-08%')
                    ->orWhere('accmast.Code', 'like',  '1-09%')
                    ->orWhere('accmast.Code', 'like',  '1-10%')
                    ->orWhere('accmast.Code', 'like',  '1-11%')
                    ->orWhere('accmast.Code', 'like',  '1-12%');
            })
            ->whereRaw('LEN(accmast.Code) > 3')
            ->where('accmast.Code', 'like',  $this->area_id.'%')
            ->select('accmast.NodeNo as customer_nodeno', 'accmast.Code as customer_code', 'accmast.Arabic_Name as customer_name', 'StudentMast.Code as emp_code','StudentMast.Arabic_Name as emp_name')
            ->orderBy('StudentMast.Code')
            ->get();
---
select [accmast].[NodeNo] as [customer_nodeno], [accmast].[Code] as [customer_code], [accmast].[Arabic_Name] as [customer_name], [StudentMast].[Code] as [emp_code], [StudentMast].[Arabic_Name] as [emp_name] from [accmast] inner join [WarrentyInfo] on [accmast].[NodeNo] = [WarrentyInfo].[AccountNo] inner join [StudentMast] on [StudentMast].[NodeNo] = [WarrentyInfo].[SalesEmployee] where [WarrentyInfo].[AccountStatus] = 'عملاء نشيطين لدى الفرع' and ([accmast].[Code] like '01%' or [accmast].[Code] like '02%' or [accmast].[Code] like '03%' or [accmast].[Code] like '04%' or [accmast].[Code] like '05%' or [accmast].[Code] like '06%' or [accmast].[Code] like '07%' or [accmast].[Code] like '08%' or [accmast].[Code] like '09%' or [accmast].[Code] like '10%' or [accmast].[Code] like '11%' or [accmast].[Code] like '12%' or [accmast].[Code] like '1-01%' or [accmast].[Code] like '1-02%' or [accmast].[Code] like '1-03%' or [accmast].[Code] like '1-04%' or [accmast].[Code] like '1-05%' or [accmast].[Code] like '1-06%' or [accmast].[Code] like '1-07%' or [accmast].[Code] like '1-08%' or [accmast].[Code] like '1-09%' or [accmast].[Code] like '1-10%' or [accmast].[Code] like '1-11%' or [accmast].[Code] like '1-12%') and LEN(accmast.Code) > 3 and [accmast].[Code] like '02%' order by [StudentMast].[Code] asc

    public function emp_codes() {

        set_time_limit(2000);
        $records = AccMast::join('WarrentyInfo', 'accmast.NodeNo','WarrentyInfo.AccountNo')
            ->join('StudentMast', 'StudentMast.NodeNo', 'WarrentyInfo.SalesEmployee')
            ->where('WarrentyInfo.AccountStatus', 'عملاء نشيطين لدى الفرع')
            ->where(function ($query) {
                $query->orWhere('accmast.Code', 'like',  '01%')
                    ->orWhere('accmast.Code', 'like',  '02%')
                    ->orWhere('accmast.Code', 'like',  '03%')
                    ->orWhere('accmast.Code', 'like',  '04%')
                    ->orWhere('accmast.Code', 'like',  '05%')
                    ->orWhere('accmast.Code', 'like',  '06%')
                    ->orWhere('accmast.Code', 'like',  '07%')
                    ->orWhere('accmast.Code', 'like',  '08%')
                    ->orWhere('accmast.Code', 'like',  '09%')
                    ->orWhere('accmast.Code', 'like',  '10%')
                    ->orWhere('accmast.Code', 'like',  '11%')
                    ->orWhere('accmast.Code', 'like',  '12%')
                    ->orWhere('accmast.Code', 'like',  '1-01%')
                    ->orWhere('accmast.Code', 'like',  '1-02%')
                    ->orWhere('accmast.Code', 'like',  '1-03%')
                    ->orWhere('accmast.Code', 'like',  '1-04%')
                    ->orWhere('accmast.Code', 'like',  '1-05%')
                    ->orWhere('accmast.Code', 'like',  '1-06%')
                    ->orWhere('accmast.Code', 'like',  '1-07%')
                    ->orWhere('accmast.Code', 'like',  '1-08%')
                    ->orWhere('accmast.Code', 'like',  '1-09%')
                    ->orWhere('accmast.Code', 'like',  '1-10%')
                    ->orWhere('accmast.Code', 'like',  '1-11%')
                    ->orWhere('accmast.Code', 'like',  '1-12%');
            })
            ->whereRaw('LEN(accmast.Code) > 3')
            ->where('accmast.Code', 'like',  $this->area_id.'%')
            ->select('StudentMast.Code as emp_code','StudentMast.Arabic_Name as emp_name')
            ->orderBy('StudentMast.Code')
            ->distinct()
            ->pluck('emp_name', 'emp_code');
---
select distinct [StudentMast].[Code] as [emp_code], [StudentMast].[Arabic_Name] as [emp_name] from [accmast] inner join [WarrentyInfo] on [accmast].[NodeNo] = [WarrentyInfo].[AccountNo] inner join [StudentMast] on [StudentMast].[NodeNo] = [WarrentyInfo].[SalesEmployee] where [WarrentyInfo].[AccountStatus] = 'عملاء نشيطين لدى الفرع' and ([accmast].[Code] like '01%' or [accmast].[Code] like '02%' or [accmast].[Code] like '03%' or [accmast].[Code] like '04%' or [accmast].[Code] like '05%' or [accmast].[Code] like '06%' or [accmast].[Code] like '07%' or [accmast].[Code] like '08%' or [accmast].[Code] like '09%' or [accmast].[Code] like '10%' or [accmast].[Code] like '11%' or [accmast].[Code] like '12%' or [accmast].[Code] like '1-01%' or [accmast].[Code] like '1-02%' or [accmast].[Code] like '1-03%' or [accmast].[Code] like '1-04%' or [accmast].[Code] like '1-05%' or [accmast].[Code] like '1-06%' or [accmast].[Code] like '1-07%' or [accmast].[Code] like '1-08%' or [accmast].[Code] like '1-09%' or [accmast].[Code] like '1-10%' or [accmast].[Code] like '1-11%' or [accmast].[Code] like '1-12%') and LEN(accmast.Code) > 3 and [accmast].[Code] like '02%' order by [StudentMast].[Code] asc

    public function collected2($customer_code, $start_date, $end_date) {

        set_time_limit(2000);
        $start_date = date($start_date . ' 00:00:00');
        $end_date = $end_date . ' 23:59:25';

//        dd($end_date);

        $collected_vouchers = FAExtra::join('StudentMast', 'FAExtra.Student', 'StudentMast.NodeNo')
            ->join('accmast', 'FAExtra.AccountNo', 'accmast.NodeNo')
            ->whereIn('accmast.Code', $customer_code)
            ->where(function ($query) {
                $query->orWhere('FAExtra.VoucherNo', 'like',  '030%')
                    ->orWhere('FAExtra.VoucherNo', 'like',  '040%')
                    ->orWhere('FAExtra.VoucherNo', 'like',  '050%');
            })
//            ->whereBetween('FAExtra.VoucherDate', [$start_date, $end_date])
            ->where('FAExtra.VoucherDate', '>=', $start_date)
            ->where('FAExtra.VoucherDate', '<=', $end_date)

            ->get('VoucherNo')->toArray();
//        dd($collected_vouchers);

        $collectedReverse = [];
        if (count($collected_vouchers) > 0) {
            $collectedReverse = FAExtra::join('StudentMast', 'FAExtra.Student', 'StudentMast.NodeNo')
                ->join('accmast', 'FAExtra.AccountNo', 'accmast.NodeNo')
                ->whereIn('accmast.Code', $customer_code)
                ->where(function ($query) {
                    $query->orWhere('VoucherNo', 'like', '031%')
                        ->orWhere('VoucherNo', 'like', '041%')
                        ->orWhere('VoucherNo', 'like', '051%');
                })
                ->whereIn('VField9', [$collected_vouchers])
                ->get('VField9')->toArray();
---
select [VField9] from [FAExtra] inner join [StudentMast] on [FAExtra].[Student] = [StudentMast].[NodeNo] inner join [accmast] on [FAExtra].[AccountNo] = [accmast].[NodeNo] where [accmast].[Code] in ('0200001', '0200006', '0200007', '0200022', '0200009', '0200010', '0200050', '0200067', '0200017', '0200025', '0200027', '0200030', '0200043', '0200055', '0200005', '0200013', '0200014', '0200019', '0200020', '0200021', '0200023', '0200044', '0200085', '0200091', '0200040', '0200049', '0200052', '0200094', '0200104', '0200105', '0200106', '0200088', '0200011', '0200092', '0200101', '0200093', '0200090', '0200086', '0200100', '0200075', '0200069', '0200057', '0200071', '0200079', '0200083', '0200070', '0200003', '0200024', '0200026', '0200031', '0200038', '0200047', '0200053', '0200039', '0200089', '0200032', '0200036', '0200004', '0200008', '0200084', '0200048', '0200064', '0200045', '0200016', '0200056', '0200073', '0200059', '0200000', '0200002', '0200015', '0200042', '0200077', '0200076', '0200096', '0200103', '0200058', '0200097', '0200095', '0200087', '0200041', '0200068', '0200060', '0200061', '0200098', '0200099', '0200102', '0200051', '0200074', '0200078', '0200035', '0200037', '0200063', '0200018', '0200046', '0200066', '0200080', '0200081', '0200082', '0200999', '0200029', '0200012', '0200028', '0200033', '0200034', '0200072', '0200065') and ([VoucherNo] like '031%' or [VoucherNo] like '041%' or [VoucherNo] like '051%') and [VField9] in ('030-01021-783')

    public function visits($emp_codes, $start_date, $end_date) {

        $visits = DB::connection('mysql2')->table('activity')
            ->join('work_places', 'activity.selected_loc', 'work_places.place_id')
            ->whereNotNull('customer_id')
            ->whereIn('author', $emp_codes)
            ->whereBetween('activity_timestamp', [$this->start_date.' 00:00:00', $this->end_date. ' 23:59:25'])
//            ->where('is_branch_visit', '!=', 'N')
//            ->where('type','a-00')
            ->where('added_using', 'W')
            ->whereNotIn('customer_id', ['0000000', '0100000', '0200000', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0900000', '1000000', '1100000', '1200000', '0109999'])
//            ->whereIn('place_id',['0101', '01011', '0102', '0103', '0104', '0105', '0106', '0107', '0108', '0109', '0110', '0111', '0112'])
            ->whereIn('place_id',['0001', '0020', '0099', '0101', '01011', '0102', '01021', '01023', '0103', '01031', '0104', '0105', '0106', '0107', '0108', '01081', '0109', '0110', '0111', '0112', '0202', '0203'])
            ->select('author', DB::raw('COUNT(DISTINCT customer_id) as num_of_visits'))
            ->groupBy('author')
            ->pluck('num_of_visits', 'author')->toArray();

        $general_visits = DB::connection('mysql2')->table('activity')
            ->join('work_places', 'activity.selected_loc', 'work_places.place_id')
            ->whereNotNull('customer_id')
            ->whereIn('author', $emp_codes)
            ->whereBetween('activity_timestamp', [$this->start_date.' 00:00:00', $this->end_date. ' 23:59:25'])
//            ->where('is_branch_visit', '!=', 'N')
//            ->where('type','a-00')
            ->where('added_using', 'W')
            ->whereIn('customer_id', ['0000000', '0100000', '0200000', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0900000', '1000000', '1100000', '1200000', '0109999'])
            ->whereIn('place_id',['0001', '0020', '0099', '0101', '01011', '0102', '01021', '01023', '0103', '01031', '0104', '0105', '0106', '0107', '0108', '01081', '0109', '0110', '0111', '0112', '0202', '0203'])
//            ->whereIn('place_id',['0101', '01011', '0102', '0103', '0104', '0105', '0106', '0107', '0108', '0109', '0110', '0111', '0112'])
            ->select('author', DB::raw('COUNT(customer_id) as num_of_visits'))
            ->groupBy('author')
            ->pluck('num_of_visits', 'author')->toArray();
---
select `author`, COUNT(DISTINCT customer_id) as num_of_visits from `activity` inner join `work_places` on `activity`.`selected_loc` = `work_places`.`place_id` where `customer_id` is not null and `author` in ('', 10066, 10068, 10203, 10261, 90001) and `activity_timestamp` between '2024-02-04 00:00:00' and '2024-02-09 23:59:25' and `added_using` = 'W' and `customer_id` not in ('0000000', '0100000', '0200000', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0900000', '1000000', '1100000', '1200000', '0109999') and `place_id` in ('0001', '0020', '0099', '0101', '01011', '0102', '01021', '01023', '0103', '01031', '0104', '0105', '0106', '0107', '0108', '01081', '0109', '0110', '0111', '0112', '0202', '0203') group by `author`
select `author`, COUNT(DISTINCT customer_id) as num_of_visits from `activity` inner join `work_places` on `activity`.`selected_loc` = `work_places`.`place_id` where `customer_id` is not null and `author` in ('', 10057, 10058, 10059, 10276) and `activity_timestamp` between '2024-02-24 00:00:00' and '2024-03-01 23:59:25' and `added_using` = 'W' and `customer_id` not in ('0000000', '0100000', '0200000', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0900000', '1000000', '1100000', '1200000', '0109999') and `place_id` in ('0001', '0020', '0099', '0101', '01011', '0102', '01021', '01023', '0103', '01031', '0104', '0105', '0106', '0107', '0108', '01081', '0109', '0110', '0111', '0112', '0202', '0203') group by `author`
select `author`, COUNT(customer_id) as num_of_visits from `activity` inner join `work_places` on `activity`.`selected_loc` = `work_places`.`place_id` where `customer_id` is not null and `author` in ('', 10066, 10068, 10203, 10261, 90001) and `activity_timestamp` between '2024-02-04 00:00:00' and '2024-02-09 23:59:25' and `added_using` = 'W' and `customer_id` in ('0000000', '0100000', '0200000', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0900000', '1000000', '1100000', '1200000', '0109999') and `place_id` in ('0001', '0020', '0099', '0101', '01011', '0102', '01021', '01023', '0103', '01031', '0104', '0105', '0106', '0107', '0108', '01081', '0109', '0110', '0111', '0112', '0202', '0203') group by `author`