app/Http/Livewire/ListMyProductTarget.php

    public function get_filters() {

        $record = ProductTargetFilter::where('user_id', Auth::id())
            ->where('page', "list")
            ->first();
---
select * from `product_target_filters` where `user_id` = 49 and `page` = 'list' limit 1

    public function save_filters() {

        $record = ProductTargetFilter::where('user_id', Auth::id())
            ->where('page', "list")
            ->first();

        if($record) {
            $a = ProductTargetFilter::where('user_id', Auth::id())
                ->where('page', "list")
                ->update([
                    'dept_id' => json_encode($this->dept_id),
                    'cat_type' => json_encode($this->cat_type),
                    'sp_type' => json_encode($this->sp_type),
                    'vendor_type' => json_encode($this->vendor_type),
                    'selected_month' => $this->selected_month,
                ]);
---
select * from `product_target_filters` where `user_id` = 1 and `page` = 'list' limit 1
update `product_target_filters` set `dept_id` = '[\"3\",\"12\"]', `cat_type` = '[\"asmedah\",\"mobedat\"]', `sp_type` = '[\"1\"]', `vendor_type` = '\"2296\"', `selected_month` = '2024-01', `product_target_filters`.`updated_at` = '2024-02-01 11:44:33' where `user_id` = 1 and `page` = 'list'