app/Http/Livewire/ListMarketingSummary.php

select * from `role` inner join `users` on `users`.`role` = `role`.`r_id` where `users`.`role` in (14, 40, 43) and `privileges` <> ''
---
    public function generateReport() {

        $this->validate();

        $this->wk_s_total = [];
        $this->wk_m_total = [];
        $this->wk_b_total = [];

//        $end_of_month_before = Carbon::create($this->start_date)->subDay()->format('Y-m-d');
//        $first_of_month_before = Carbon::create($end_of_month_before)->subMonths(2)->addDay()->format('Y-m-d');

        $end_of_month_before = Carbon::create($this->end_date)->format('Y-m-d');
        $first_of_month_before = Carbon::create($end_of_month_before)->subMonths(2)->addDay()->format('Y-m-d');
//        dd('first-date: '. $first_of_month_before . "| end-date: ". $end_of_month_before);

        $this->month_start_date = $first_of_month_before;
        $this->month_end_date = $end_of_month_before;
        $this->year_end_date = Carbon::create($this->end_date)->subYear()->format('Y-m-d');

        $this->employees = DB::connection('mysql2')->table('role')
            ->join('users', 'users.role', 'role.r_id')
            ->whereIn('users.role', [14, 40, 43])
            ->where('privileges', '<>', '')
            ->get();

select `author`, COUNT(DISTINCT customer_id) as num_of_visits from `activity` inner join `work_places` on `activity`.`selected_loc` = `work_places`.`place_id` where `customer_id` is not null and `customer_id` not in ('0000000', '0100000', '0109999', '0200000', '0200999', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0800999', '0809999', '0900000', '1000000', '1100000', '1200000') and `author` in (10200, 10224, 10271) and `activity_timestamp` between '2024-02-03 00:00:00' and '2024-02-09 23:59:59' and `type` = 'a-00' and `place_id` in ('0101', '0102', '0103', '0104', '0105', '0106', '0107', '0108', '0109', '0110', '0111', '0112') group by `author`
---
            ->groupBy('author')
            ->pluck('num_of_visits', 'author')->toArray();

        $visits_general_customers = DB::connection('mysql2')->table('activity')
            ->join('work_places', 'activity.selected_loc', 'work_places.place_id')
            ->whereNotNull('customer_id')
            ->whereIn('customer_id', ['0000000', '0100000', '0109999', '0200000', '0200999', '0300000', '0400000', '0500000', '0600000', '0700000', '0800000', '0800999', '0809999', '0900000', '1000000', '1100000', '1200000'])
            ->whereIn('author', $employees_ids)
            ->whereBetween('activity_timestamp', [$this->start_date.' 00:00:00', $this->end_date.' 23:59:59'])