app/Http/Livewire/ListUser.php

    public function render()
    {
//        dd(json_decode(Auth::user()->user_group->report_type));
        $users = User::orderBy('created_at', 'DESC')->paginate(20);
---
select * from `users` order by `created_at` desc limit 20 offset 20
select count(*) as aggregate from `users`