app/Http/Livewire/ListMyProductTarget.php

select DISTINCT accmast.NodeNo, accmast.Arabic_Name from [accmast] inner join [ProductMast] on [ProductMast].[VendorNo] = [accmast].[NodeNo] where [ProductMast].[PriceList] = 1
---
    public function mount() {
        set_time_limit(2000);
        ini_set('memory_limit', '2048M');

//        $this->selected_month = Carbon::parse(Carbon::now())->format('Y-m');
        $this->key = now();

        $this->vendor_list = AccMast::join('ProductMast', 'ProductMast.VendorNo', 'accmast.NodeNo')
            ->where('ProductMast.PriceList', 1)
            ->selectRaw('DISTINCT accmast.NodeNo, accmast.Arabic_Name')
            ->get();

select * from `settings` limit 1
select `users`.`id` from `users` inner join `user_groups` on `user_groups`.`id` = `users`.`group` where `branches` like '%\"13\"%' and write_product_target IN (1,2)
---
    public function render()
    {
        set_time_limit(2000);
        ini_set('memory_limit', '2048M');

        $branches = json_decode(Auth::user()->branches);
        $this->user_branches = $branches;

        $settings_record = Setting::first();
        $this->item_price = $settings_record->item_price;

        foreach ($branches as $branch) {
            $emps = User::join('user_groups', 'user_groups.id', 'users.group')
                ->where('branches', 'like', '%"'.$branch.'"%')
//                ->whereIn('write_product_target', ['1', '2'])
                ->whereRaw('write_product_target IN (1,2)')
                ->select('users.id')
                ->get();

select distinct `users`.`id`, `users`.`name`, `users`.`emp_code` from `users` inner join `user_groups` on `users`.`group` = `user_groups`.`id` where `branches` LIKE '%\"13\"%' and `group` is not null and `role` = 'u' and write_product_target IN (1,2)
---
    public function generateReport() {
        set_time_limit(2000);
        ini_set('memory_limit', '2048M');
        $this->validate();

        $this->save_filters();

        if (in_array('dept_all', $this->dept_id)) {
            $this->dept_id = $this->user_branches;
        }

        $this->emit('show-container');
//        $this->items = [];
        $month_stmt = null;
        $this->results = [];
//        $this->products_items = [];

//        $query = DB::connection('sqlsrv')->select($month_stmt);
//        $this->results = $query;


        if (count($this->dept_id) == 1) {
            $this->users = User::join('user_groups', 'users.group', 'user_groups.id')
                ->where('branches', 'LIKE' ,'%"'.$this->dept_id[0].'"%')
                ->whereNotNull('group')
                ->where('role', 'u')
//                ->whereIn('write_product_target', ['1', '2'])
                ->whereRaw('write_product_target IN (1,2)')
//                ->where('group', '!=', 4)
//                ->where('group', '!=', 5)
//                ->whereNotIn('id', [1,13,14,15,16,18,21,38])
                ->select('users.id', 'users.name', 'users.emp_code')
                ->distinct()
                ->get();

select * from `product_target_filters` where `user_id` = 43 and `page` = 'list' limit 1
---
    public function get_filters() {

        $record = ProductTargetFilter::where('user_id', Auth::id())
            ->where('page', "list")
            ->first();

select * from `product_target_filters` where `user_id` = 43 and `page` = 'list' limit 1
update `product_target_filters` set `dept_id` = '[\"13\"]', `cat_type` = '[\"cat_all\"]', `sp_type` = '[\"sp_all\"]', `vendor_type` = '\"2295\"', `selected_month` = '2024-02', `product_target_filters`.`updated_at` = '2024-02-15 07:00:14' where `user_id` = 43 and `page` = 'list'
---
    public function save_filters() {

        $record = ProductTargetFilter::where('user_id', Auth::id())
            ->where('page', "list")
            ->first();

        if($record) {
            $a = ProductTargetFilter::where('user_id', Auth::id())
                ->where('page', "list")
                ->update([
                    'dept_id' => json_encode($this->dept_id),
                    'cat_type' => json_encode($this->cat_type),
                    'sp_type' => json_encode($this->sp_type),
                    'vendor_type' => json_encode($this->vendor_type),
                    'selected_month' => $this->selected_month,
                ]);

select distinct `users`.`id`, `users`.`emp_code`, `users`.`name` from `users` inner join `user_groups` on `users`.`group` = `user_groups`.`id` where `branches` LIKE '%\"13\"%' and `group` is not null and `role` = 'u' and write_product_target IN (1,2)
---

            if (count($this->dept_id) == 1) {

                $this->users = User::join('user_groups', 'users.group', 'user_groups.id')
                    ->where('branches', 'LIKE' ,'%"'.$this->dept_id[0].'"%')
                    ->whereNotNull('group')
                    ->where('role', 'u')
                    ->whereRaw('write_product_target IN (1,2)')
                    ->select('users.id','users.emp_code', 'users.name')
                    ->distinct()