app/Http/Livewire/PurchaseRecommendation.php

    public function mount() {

        $this->vendor_list = AccMast::join('ProductMast', 'ProductMast.VendorNo', 'accmast.NodeNo')
            ->where('ProductMast.PriceList', 1)
            ->selectRaw('DISTINCT accmast.NodeNo, accmast.Arabic_Name')
            ->get();
---
select DISTINCT accmast.NodeNo, accmast.Arabic_Name from [accmast] inner join [ProductMast] on [ProductMast].[VendorNo] = [accmast].[NodeNo] where [ProductMast].[PriceList] = 1

    public function render()
    {
        $settings_record = Setting::first();
---
select * from `settings` limit 1